carloscn/s32k344_rtd/Mcl_TS_T40D34M30I0R0/generate_PC/include/Dma_Ip_Cfg_DeviceRegistersV3.h
/*==================================================================================================
*   Project              : RTD AUTOSAR 4.7
*   Platform             : CORTEXM
*   Peripheral           : DMA,CACHE,TRGMUX,LCU,EMIOS,FLEXIO
*   Dependencies         : none
*
*   Autosar Version      : 4.7.0
*   Autosar Revision     : ASR_REL_4_7_REV_0000
*   Autosar Conf.Variant :
*   SW Version           : 3.0.0
*   Build Version        : S32K3_RTD_3_0_0_D2303_ASR_REL_4_7_REV_0000_20230331
*
*   Copyright 2020 - 2023 NXP Semiconductors
*   
*
*   NXP Confidential. This software is owned or controlled by NXP and may only be
*   used strictly in accordance with the applicable license terms. By expressly
*   accepting such terms or by downloading, installing, activating and/or otherwise
*   using the software, you are agreeing that you have read, and that you agree to
*   comply with and are bound by, such license terms. If you do not agree to be
*   bound by the applicable license terms, then you may not retain, install,
*   activate or otherwise use the software.
==================================================================================================*/

/* Prevention from multiple including the same header */
#ifndef DMA_IP_CFG_DEVICE_REGISTERS_V3_H_
#define DMA_IP_CFG_DEVICE_REGISTERS_V3_H_

/**
*   @file    Dma_Ip_Cfg_DeviceRegistersV3.h
*
*   @version 3.0.0
*
*   @brief   AUTOSAR Mcl - Dma Ip Cfg Device Register V3 header file.
*   @details Contains common register information and specific register information for
*            DMA Hardware Version 3.
*
*   @addtogroup DMA_IP_DRIVER DMA IP Driver
*   @{
*/

#ifdef __cplusplus
extern "C"
{
#endif

/*==================================================================================================
                                         INCLUDE FILES
 1) system and project includes
 2) needed interfaces from external units
 3) internal and external interfaces from this unit
==================================================================================================*/
#include "Mcal.h"
#include "BasicTypes.h"
[!INDENT "0"!][!//
[!IF "node:exists(as:modconf("Resource")[1]/ResourceGeneral/ResourceSubderivative)"!][!//
    [!VAR "DerivativeName" = "text:toupper(substring-before(as:modconf("Resource")[1]/ResourceGeneral/ResourceSubderivative,'_'))"!]
    [!IF "contains($DerivativeName, 'S32K3')"!][!//
        [!IF "contains($DerivativeName, 'S32K396') or contains($DerivativeName, 'S32K394')"!][!//
            [!CODE!][!WS "0"!]#include "S32K39_EDMA.h"[!CR!][!ENDCODE!][!//
            [!CODE!][!WS "0"!]
            #include "S32K39_DMA_TCD_0.h"
            #include "S32K39_DMA_TCD_1.h"
            [!CR!][!ENDCODE!][!//
        [!ELSEIF "contains($DerivativeName, 'S32K358') or contains($DerivativeName, 'S32K388') or contains($DerivativeName, 'S32K311')"!][!//
            [!CODE!][!WS "0"!]#include "[!"$DerivativeName"!]_EDMA.h"[!CR!][!ENDCODE!][!//
            [!CODE!][!WS "0"!]
            #include "[!"$DerivativeName"!]_DMA_TCD.h"
            [!CR!][!ENDCODE!][!//
        [!ELSEIF "contains($DerivativeName, 'S32K310')"!][!//
            [!CODE!][!WS "0"!]#include "S32K311_EDMA.h"[!CR!][!ENDCODE!][!//
            [!CODE!][!WS "0"!]
            #include "S32K311_DMA_TCD.h"
            [!CR!][!ENDCODE!][!//
        [!ELSEIF "contains($DerivativeName, 'S32K328') or contains($DerivativeName, 'S32K338') or contains($DerivativeName, 'S32K348')"!][!//
            [!CODE!][!WS "0"!]#include "S32K358_EDMA.h"[!CR!][!ENDCODE!][!//
            [!CODE!][!WS "0"!]
            #include "S32K358_DMA_TCD.h"
            [!CR!][!ENDCODE!][!//
        [!ELSE!][!//
            [!CODE!][!WS "0"!]#include "[!"$DerivativeName"!]_DMA.h"[!CR!][!ENDCODE!][!//
            [!CODE!][!WS "0"!]
            #include "[!"$DerivativeName"!]_DMA_TCD.h"
            [!CR!][!ENDCODE!][!//
        [!ENDIF!][!//
    [!ELSEIF "contains($DerivativeName, 'S32M276') or contains($DerivativeName, 'S32M274')"!][!//
        [!CODE!][!WS "0"!]#include "S32M27x_EDMA.h"[!CR!][!ENDCODE!][!//
        [!CODE!][!WS "0"!]#include "S32M27x_DMA_TCD.h"[!CR!][!ENDCODE!][!//
    [!ELSE!][!//
        [!ERROR "The Resource plugin or ResourceSubderivative field is not available for header file inclusion."!][!//
    [!ENDIF!][!//
    [!IF "contains($DerivativeName, 'S32K396') or contains($DerivativeName, 'S32K394')"!][!//
        [!CODE!]
        #define DMA_TCD_INSTANCE_COUNT        eDMA_INSTANCE_COUNT
        [!ENDCODE!][!//
    [!ENDIF!][!//
[!ENDIF!][!//
[!ENDINDENT!][!//

/*==================================================================================================
                               SOURCE FILE VERSION INFORMATION
==================================================================================================*/
#define DMA_IP_CFG_DEVICEREGISTERSV3_VENDOR_ID                       43
#define DMA_IP_CFG_DEVICEREGISTERSV3_AR_RELEASE_MAJOR_VERSION        4
#define DMA_IP_CFG_DEVICEREGISTERSV3_AR_RELEASE_MINOR_VERSION        7
#define DMA_IP_CFG_DEVICEREGISTERSV3_AR_RELEASE_REVISION_VERSION     0
#define DMA_IP_CFG_DEVICEREGISTERSV3_SW_MAJOR_VERSION                3
#define DMA_IP_CFG_DEVICEREGISTERSV3_SW_MINOR_VERSION                0
#define DMA_IP_CFG_DEVICEREGISTERSV3_SW_PATCH_VERSION                0

/*==================================================================================================
                                      FILE VERSION CHECKS
==================================================================================================*/
#ifndef DISABLE_MCAL_INTERMODULE_ASR_CHECK
/* Check if header file and Mcal header file are of the same Autosar version */
#if ((DMA_IP_CFG_DEVICEREGISTERSV3_AR_RELEASE_MAJOR_VERSION != MCAL_AR_RELEASE_MAJOR_VERSION) || \
     (DMA_IP_CFG_DEVICEREGISTERSV3_AR_RELEASE_MINOR_VERSION != MCAL_AR_RELEASE_MINOR_VERSION))
    #error "AutoSar Version Numbers of Dma_Ip_Cfg_DeviceRegisters.h and Mcal.h are different"
#endif
#endif
/*==================================================================================================
                                            DEFINES
==================================================================================================*/
/*-----------------------------------------------/
/  DMA HWV3 INSTANCES                            /
/-----------------------------------------------*/
[!IF "contains($DerivativeName, 'S32K396') or contains($DerivativeName, 'S32K394')"!][!//
    [!CODE!][!WS "0"!]
    #define DMA_IP_DMA_0_BASE                   (0x4020C000U)
    #define DMA_IP_DMA_0_BASE_PTR               ((Dma_Ip_Hwv3InstRegType *)DMA_IP_DMA_0_BASE)
    #define DMA_IP_DMA_1_BASE                   (0x40010000U)
    #define DMA_IP_DMA_1_BASE_PTR               ((Dma_Ip_Hwv3InstRegType *)DMA_IP_DMA_1_BASE)
    #define DMA_IP_DMA_BASE_PTRS               {DMA_IP_DMA_0_BASE_PTR, DMA_IP_DMA_1_BASE_PTR}
    [!CR!][!ENDCODE!][!//
[!ELSE!][!//
    [!CODE!][!WS "0"!]
    #define DMA_IP_BASE                         (0x4020C000U)
    #define DMA_IP_PTR                          ((Dma_Ip_Hwv3InstRegType *)DMA_IP_BASE)
    #define DMA_IP_DMA_BASE_PTRS                { DMA_IP_PTR }
    [!CR!][!ENDCODE!][!//
[!ENDIF!][!//

#define DMA_IP_DMA_MP_GRPRI_COUNT           DMA_IP_MP_GRPRI_COUNT
#define DMA_IP_MP_GRPRI_COUNT               ((uint32)32U)

[!IF "contains($DerivativeName, 'S32K396') or contains($DerivativeName, 'S32K394')"!][!//
    [!CODE!][!WS "0"!]
    #define DMA_IP_DMA_NOF_HWV3_INST            ((uint32)2U)  /* Total number of hardware instances */
    [!CR!][!ENDCODE!][!//
[!ELSE!][!//
    [!CODE!][!WS "0"!]
    #define DMA_IP_DMA_NOF_HWV3_INST            ((uint32)1U)   /* Total number of hardware instances */
    [!CR!][!ENDCODE!][!//
[!ENDIF!][!//


